/*******************************************************************
* 时间复杂度：O(n)
* 说明：
* 1. 顺序排列为偶排列
* 2. 交换任意两个数，排列奇偶性改变
* 3. 排列奇偶性等于逆序对数奇偶性
* 4. 求环的个数可以O(n)求得排列奇偶性
*******************************************************************/
void solve()
{
    cin >> n;
    for (int i = 1; i <= n; ++i) cin >> a[i];
    bool inv = n & 1;
    vector<bool> vis(n + 1);
    for (int i = 1; i <= n; ++i)
    {
        if (vis[i]) continue;
        int cur = i;
        while (!vis[cur])
        {
            vis[cur] = 1;
            cur = a[cur];
        }
        inv ^= 1;
    }
    return;
}